{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "Contexts",
			"Children": [
				{
					"Source":
					{
						"Text": "WidgetGenCodeTool Plugin"
					},
					"Translation":
					{
						"Text": "WidgetGenCodeTool Plugin"
					},
					"Key": "WidgetGenCodeTool"
				}
			]
		},
		{
			"Namespace": "SModuleSelecter",
			"Children": [
				{
					"Source":
					{
						"Text": "Choose the target module for your new class"
					},
					"Translation":
					{
						"Text": "Choose the target module for your new class"
					},
					"Key": "ModuleComboToolTip"
				},
				{
					"Source":
					{
						"Text": "{ModuleName} ({ModuleType})"
					},
					"Translation":
					{
						"Text": "{ModuleName} ({ModuleType})"
					},
					"Key": "ModuleComboEntry"
				}
			]
		},
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "WidgetGenCodeTool",
					"Children": [
						{
							"Source":
							{
								"Text": "Execute WidgetGenCodeTool action"
							},
							"Translation":
							{
								"Text": "Execute WidgetGenCodeTool action"
							},
							"Key": "PluginAction_ToolTip"
						},
						{
							"Source":
							{
								"Text": "WidgetGenCodeTool"
							},
							"Translation":
							{
								"Text": "WidgetGenCodeTool"
							},
							"Key": "PluginAction"
						}
					]
				}
			]
		},
		{
			"Namespace": "WidgetGenCodeTool",
			"Children": [
				{
					"Source":
					{
						"Text": "A Classes class can be included and used inside other modules in addition to the module it resides in"
					},
					"Translation":
					{
						"Text": "A Classes class can be included and used inside other modules in addition to the module it resides in"
					},
					"Key": "ClassLocation_Classes"
				},
				{
					"Source":
					{
						"Text": "A private class can only be included and used within the module it resides in"
					},
					"Translation":
					{
						"Text": "A private class can only be included and used within the module it resides in"
					},
					"Key": "ClassLocation_Private"
				},
				{
					"Source":
					{
						"Text": "A public class can be included and used inside other modules in addition to the module it resides in"
					},
					"Translation":
					{
						"Text": "A public class can be included and used inside other modules in addition to the module it resides in"
					},
					"Key": "ClassLocation_Public"
				},
				{
					"Source":
					{
						"Text": "Add Generated Widget Code Class"
					},
					"Translation":
					{
						"Text": "Add Generated Widget Code Class"
					},
					"Key": "AddCodeWindowHeader_GenWidgetCode"
				},
				{
					"Source":
					{
						"Text": "Added new class {0}"
					},
					"Translation":
					{
						"Text": "Added new class {0}"
					},
					"Key": "AddedClassSuccessNotification"
				},
				{
					"Source":
					{
						"Text": "Adding code to project..."
					},
					"Translation":
					{
						"Text": "Adding code to project..."
					},
					"Key": "AddingCodeToProject"
				},
				{
					"Source":
					{
						"Text": "Choose a source location"
					},
					"Translation":
					{
						"Text": "Choose a source location"
					},
					"Key": "NewClassBrowseTitle"
				},
				{
					"Source":
					{
						"Text": "Choose the target module for your new class"
					},
					"Translation":
					{
						"Text": "Choose the target module for your new class"
					},
					"Key": "ModuleComboToolTip"
				},
				{
					"Source":
					{
						"Text": "Class Type"
					},
					"Translation":
					{
						"Text": "Class Type"
					},
					"Key": "ClassTypeLabel"
				},
				{
					"Source":
					{
						"Text": "Classes"
					},
					"Translation":
					{
						"Text": "Classes"
					},
					"Key": "Classes"
				},
				{
					"Source":
					{
						"Text": "Create Class"
					},
					"Translation":
					{
						"Text": "Create Class"
					},
					"Key": "FinishButtonText_Native"
				},
				{
					"Source":
					{
						"Text": "Creates the code files to add your new class."
					},
					"Translation":
					{
						"Text": "Creates the code files to add your new class."
					},
					"Key": "FinishButtonToolTip_Native"
				},
				{
					"Source":
					{
						"Text": "Enter a name for your new class. Class names may only contain alphanumeric characters, and may not contain a space."
					},
					"Translation":
					{
						"Text": "Enter a name for your new class. Class names may only contain alphanumeric characters, and may not contain a space."
					},
					"Key": "ClassNameDescription"
				},
				{
					"Source":
					{
						"Text": "Failed to add class '{0}'. {1}"
					},
					"Translation":
					{
						"Text": "Failed to add class '{0}'. {1}"
					},
					"Key": "AddCodeFailed_AddCodeFailed"
				},
				{
					"Source":
					{
						"Text": "Failed to automatically compile the '{0}' module."
					},
					"Translation":
					{
						"Text": "Failed to automatically compile the '{0}' module."
					},
					"Key": "FailedToCompileModuleFmt"
				},
				{
					"Source":
					{
						"Text": "Failed to automatically hot reload the '{0}' module."
					},
					"Translation":
					{
						"Text": "Failed to automatically hot reload the '{0}' module."
					},
					"Key": "FailedToHotReloadModuleFmt"
				},
				{
					"Source":
					{
						"Text": "Failed to compile newly created game module."
					},
					"Translation":
					{
						"Text": "Failed to compile newly created game module."
					},
					"Key": "FailedToCompileNewGameModule"
				},
				{
					"Source":
					{
						"Text": "Failed to generate project files."
					},
					"Translation":
					{
						"Text": "Failed to generate project files."
					},
					"Key": "FailedToGenerateProjectFiles"
				},
				{
					"Source":
					{
						"Text": "Failed to read template file \"{FullFileName}\""
					},
					"Translation":
					{
						"Text": "Failed to read template file \"{FullFileName}\""
					},
					"Key": "FailedToReadTemplateFile"
				},
				{
					"Source":
					{
						"Text": "Generate C++ code from Widget"
					},
					"Translation":
					{
						"Text": "Generate C++ code from Widget"
					},
					"Key": "WidgetGenCodeTooltip"
				},
				{
					"Source":
					{
						"Text": "Header File"
					},
					"Translation":
					{
						"Text": "Header File"
					},
					"Key": "HeaderFileLabel"
				},
				{
					"Source":
					{
						"Text": "Name"
					},
					"Translation":
					{
						"Text": "Name"
					},
					"Key": "NameLabel"
				},
				{
					"Source":
					{
						"Text": "Name Your New Class"
					},
					"Translation":
					{
						"Text": "Name Your New Class"
					},
					"Key": "NameClassGenericTitle"
				},
				{
					"Source":
					{
						"Text": "Path"
					},
					"Translation":
					{
						"Text": "Path"
					},
					"Key": "PathLabel"
				},
				{
					"Source":
					{
						"Text": "Private"
					},
					"Translation":
					{
						"Text": "Private"
					},
					"Key": "Private"
				},
				{
					"Source":
					{
						"Text": "Project now includes sources, please close the editor and build from your IDE."
					},
					"Translation":
					{
						"Text": "Project now includes sources, please close the editor and build from your IDE."
					},
					"Key": "LiveCodingNoSources"
				},
				{
					"Source":
					{
						"Text": "Public"
					},
					"Translation":
					{
						"Text": "Public"
					},
					"Key": "Public"
				},
				{
					"Source":
					{
						"Text": "Source File"
					},
					"Translation":
					{
						"Text": "Source File"
					},
					"Key": "SourceFileLabel"
				},
				{
					"Source":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser."
					},
					"Translation":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser."
					},
					"Key": "AddCodeSuccessWithHotReload"
				},
				{
					"Source":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser.\n\nWould you like to edit the code now?"
					},
					"Translation":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser.\n\nWould you like to edit the code now?"
					},
					"Key": "AddCodeSuccessWithHotReloadAndSync"
				},
				{
					"Source":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser. {2}\n\nWould you like to open the Output Log to see more details?"
					},
					"Translation":
					{
						"Text": "Successfully added class '{0}', however you must recompile the '{1}' module before it will appear in the Content Browser. {2}\n\nWould you like to open the Output Log to see more details?"
					},
					"Key": "AddCodeFailed_HotReloadFailed"
				},
				{
					"Source":
					{
						"Text": "When you click the \"Create\" button below, a header (.h) file and a source (.cpp) file will be made using this name."
					},
					"Translation":
					{
						"Text": "When you click the \"Create\" button below, a header (.h) file and a source (.cpp) file will be made using this name."
					},
					"Key": "ClassNameDetails_Native"
				},
				{
					"Source":
					{
						"Text": "Widget Gen Code"
					},
					"Translation":
					{
						"Text": "Widget Gen Code"
					},
					"Key": "WidgetGenCode"
				},
				{
					"Source":
					{
						"Text": "{ModuleName} ({ModuleType})"
					},
					"Translation":
					{
						"Text": "{ModuleName} ({ModuleType})"
					},
					"Key": "ModuleComboEntry"
				}
			]
		}
	]
}